*** src/ffi.rs:172:5: replace cf_num -> *const c_void with Default::default()

*** mutation diff:
--- src/ffi.rs
+++ replace cf_num -> *const c_void with Default::default()
@@ -164,23 +164,17 @@
 pub fn cf_str(s: &str) -> CFStringRef {
     unsafe {
         let c = std::ffi::CString::new(s).unwrap();
         CFStringCreateWithCString(ptr::null(), c.as_ptr(), kCFStringEncodingUTF8)
     }
 }
 
 pub fn cf_num(v: i32) -> *const c_void {
-    unsafe {
-        CFNumberCreate(
-            ptr::null(),
-            kCFNumberSInt32Type,
-            &v as *const i32 as *const c_void,
-        )
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn sel(name: &str) -> ObjcSel {
     let c = std::ffi::CString::new(name).unwrap();
     unsafe { sel_registerName(c.as_ptr()) }
 }
 
 pub fn cls(name: &str) -> ObjcClass {

*** result: Failure(101)
