*** src/ffi.rs:187:5: replace cls -> ObjcClass with Default::default()

*** mutation diff:
--- src/ffi.rs
+++ replace cls -> ObjcClass with Default::default()
@@ -179,18 +179,17 @@
 }
 
 pub fn sel(name: &str) -> ObjcSel {
     let c = std::ffi::CString::new(name).unwrap();
     unsafe { sel_registerName(c.as_ptr()) }
 }
 
 pub fn cls(name: &str) -> ObjcClass {
-    let c = std::ffi::CString::new(name).unwrap();
-    unsafe { objc_getClass(c.as_ptr()) }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn nserror_string(err: ObjcId) -> Option<String> {
     if err.is_null() {
         return None;
     }
     unsafe {
         type MsgSendId = unsafe extern "C" fn(ObjcId, ObjcSel) -> ObjcId;

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:
called `Result::unwrap()` on an `Err` value: ClassNotFound("_ANEInMemoryModelDescriptor")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- run_direct_with_unimem_block stdout ----

thread 'run_direct_with_unimem_block' panicked at tests/hardware.rs:154:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
