*** src/ffi.rs:213:5: replace kern_err -> String with String::new()

*** mutation diff:
--- src/ffi.rs
+++ replace kern_err -> String with String::new()
@@ -205,19 +205,10 @@
         if cstr.is_null() {
             return None;
         }
         Some(CStr::from_ptr(cstr).to_string_lossy().into_owned())
     }
 }
 
 pub fn kern_err(kr: kern_return_t) -> String {
-    match kr {
-        0 => "KERN_SUCCESS".into(),
-        KIO_BAD_ARG => "kIOReturnBadArgument".into(),
-        KIO_NOT_PRIV => "kIOReturnNotPrivileged".into(),
-        KIO_UNSUPPORTED => "kIOReturnUnsupported".into(),
-        KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
-        KIO_NOT_READY => "kIOReturnNotReady".into(),
-        KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
-        _ => format!("{:#010x}", kr as u32),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

---- run_direct_with_raw_surfaces stdout ----

thread 'run_direct_with_raw_surfaces' panicked at tests/hardware.rs:114:47:

---- run_direct_with_unimem_block stdout ----

thread 'run_direct_with_unimem_block' panicked at tests/hardware.rs:154:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- run_without_load_fails stdout ----

thread 'run_without_load_fails' panicked at tests/hardware.rs:69:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.74s

*** result: Failure(101)
