*** src/ffi.rs:215:9: delete match arm KIO_BAD_ARG in kern_err

*** mutation diff:
--- src/ffi.rs
+++ delete match arm KIO_BAD_ARG in kern_err
@@ -207,17 +207,17 @@
         }
         Some(CStr::from_ptr(cstr).to_string_lossy().into_owned())
     }
 }
 
 pub fn kern_err(kr: kern_return_t) -> String {
     match kr {
         0 => "KERN_SUCCESS".into(),
-        KIO_BAD_ARG => "kIOReturnBadArgument".into(),
+         /* ~ changed by cargo-mutants ~ */
         KIO_NOT_PRIV => "kIOReturnNotPrivileged".into(),
         KIO_UNSUPPORTED => "kIOReturnUnsupported".into(),
         KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
         KIO_NOT_READY => "kIOReturnNotReady".into(),
         KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
         _ => format!("{:#010x}", kr as u32),
     }
 }

*** result: Success
