*** src/ffi.rs:218:9: delete match arm KIO_EXCLUSIVE in kern_err

*** mutation diff:
--- src/ffi.rs
+++ delete match arm KIO_EXCLUSIVE in kern_err
@@ -210,14 +210,14 @@
 }
 
 pub fn kern_err(kr: kern_return_t) -> String {
     match kr {
         0 => "KERN_SUCCESS".into(),
         KIO_BAD_ARG => "kIOReturnBadArgument".into(),
         KIO_NOT_PRIV => "kIOReturnNotPrivileged".into(),
         KIO_UNSUPPORTED => "kIOReturnUnsupported".into(),
-        KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
+         /* ~ changed by cargo-mutants ~ */
         KIO_NOT_READY => "kIOReturnNotReady".into(),
         KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
         _ => format!("{:#010x}", kr as u32),
     }
 }

*** result: Success
