*** src/mil/mod.rs:103:40: replace * with + in pack_weights

*** mutation diff:
--- src/mil/mod.rs
+++ replace * with + in pack_weights
@@ -95,17 +95,17 @@
         input_spatial: sp,
         output_channels: oc,
         output_spatial: seq,
     }
 }
 
 /// Build an ANE weight blob: 128-byte header + fp16 data.
 pub fn pack_weights(fp16_data: &[u16]) -> Vec<u8> {
-    let weight_bytes = fp16_data.len() * 2;
+    let weight_bytes = fp16_data.len() + /* ~ changed by cargo-mutants ~ */ 2;
     let total = 128 + weight_bytes;
     let mut blob = vec![0u8; total];
     blob[0] = 1;
     blob[4] = 2;
     blob[64] = 0xEF;
     blob[65] = 0xBE;
     blob[66] = 0xAD;
     blob[67] = 0xDE;

---- pack_weights_length_and_header stdout ----

thread 'pack_weights_length_and_header' panicked at src/mil/mod.rs:117:13:
range end index 260 out of range for slice of length 258

---- pack_weights_empty stdout ----

thread 'pack_weights_empty' panicked at tests/integration.rs:128:5:
assertion `left == right` failed
  left: 130
 right: 128

failures:
    pack_weights_empty
    pack_weights_length_and_header

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
