*** src/mil/mod.rs:103:5: replace pack_weights -> Vec<u8> with vec![1]

*** mutation diff:
--- src/mil/mod.rs
+++ replace pack_weights -> Vec<u8> with vec![1]
@@ -95,26 +95,10 @@
         input_spatial: sp,
         output_channels: oc,
         output_spatial: seq,
     }
 }
 
 /// Build an ANE weight blob: 128-byte header + fp16 data.
 pub fn pack_weights(fp16_data: &[u16]) -> Vec<u8> {
-    let weight_bytes = fp16_data.len() * 2;
-    let total = 128 + weight_bytes;
-    let mut blob = vec![0u8; total];
-    blob[0] = 1;
-    blob[4] = 2;
-    blob[64] = 0xEF;
-    blob[65] = 0xBE;
-    blob[66] = 0xAD;
-    blob[67] = 0xDE;
-    blob[68] = 1;
-    blob[72..76].copy_from_slice(&(weight_bytes as u32).to_le_bytes());
-    blob[80..84].copy_from_slice(&128u32.to_le_bytes());
-    for (i, &val) in fp16_data.iter().enumerate() {
-        let off = 128 + i * 2;
-        blob[off..off + 2].copy_from_slice(&val.to_le_bytes());
-    }
-    blob
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }

---- pack_weights_length_and_header stdout ----

thread 'pack_weights_length_and_header' panicked at tests/integration.rs:106:5:
assertion `left == right` failed
  left: 1
 right: 384

---- pack_weights_empty stdout ----

thread 'pack_weights_empty' panicked at tests/integration.rs:128:5:
assertion `left == right` failed
  left: 1
 right: 128

failures:
    pack_weights_empty
    pack_weights_length_and_header

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
