*** src/mil/mod.rs:116:23: replace + with - in pack_weights

*** mutation diff:
--- src/mil/mod.rs
+++ replace + with - in pack_weights
@@ -108,13 +108,13 @@
     blob[64] = 0xEF;
     blob[65] = 0xBE;
     blob[66] = 0xAD;
     blob[67] = 0xDE;
     blob[68] = 1;
     blob[72..76].copy_from_slice(&(weight_bytes as u32).to_le_bytes());
     blob[80..84].copy_from_slice(&128u32.to_le_bytes());
     for (i, &val) in fp16_data.iter().enumerate() {
-        let off = 128 + i * 2;
+        let off = 128 - /* ~ changed by cargo-mutants ~ */ i * 2;
         blob[off..off + 2].copy_from_slice(&val.to_le_bytes());
     }
     blob
 }

---- pack_weights_length_and_header stdout ----

thread 'pack_weights_length_and_header' panicked at src/mil/mod.rs:116:19:
attempt to subtract with overflow

failures:
    pack_weights_length_and_header

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
