*** src/mil/mod.rs:23:9: replace Source::as_str -> &str with ""

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::as_str -> &str with ""
@@ -15,17 +15,17 @@
     pub input_channels: usize,
     pub input_spatial: usize,
     pub output_channels: usize,
     pub output_spatial: usize,
 }
 
 impl Source {
     pub fn as_str(&self) -> &str {
-        &self.text
+        "" /* ~ changed by cargo-mutants ~ */
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {

---- run_direct_with_unimem_block stdout ----

thread 'run_direct_with_unimem_block' panicked at tests/hardware.rs:160:47:

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- multiple_runs_same_model stdout ----

thread 'multiple_runs_same_model' panicked at tests/hardware.rs:79:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
