*** src/mil/mod.rs:23:9: replace Source::as_str -> &str with "xyzzy"

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::as_str -> &str with "xyzzy"
@@ -15,17 +15,17 @@
     pub input_channels: usize,
     pub input_spatial: usize,
     pub output_channels: usize,
     pub output_spatial: usize,
 }
 
 impl Source {
     pub fn as_str(&self) -> &str {
-        &self.text
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:14:47:

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:21:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
