*** src/mil/mod.rs:26:9: replace Source::input_shape -> (usize, usize) with (0, 0)

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::input_shape -> (usize, usize) with (0, 0)
@@ -18,17 +18,17 @@
     pub output_spatial: usize,
 }
 
 impl Source {
     pub fn as_str(&self) -> &str {
         &self.text
     }
     pub fn input_shape(&self) -> (usize, usize) {
-        (self.input_channels, self.input_spatial)
+        (0, 0) /* ~ changed by cargo-mutants ~ */
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {
         self.input_channels * self.input_spatial * 2
     }
     pub fn output_size(&self) -> usize {

---- mil_matmul_shape stdout ----

thread 'mil_matmul_shape' panicked at tests/integration.rs:82:5:
assertion `left == right` failed
  left: (0, 0)
 right: (64, 128)

failures:
    mil_matmul_shape

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
