*** src/mil/mod.rs:29:9: replace Source::output_shape -> (usize, usize) with (0, 1)

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::output_shape -> (usize, usize) with (0, 1)
@@ -21,17 +21,17 @@
 impl Source {
     pub fn as_str(&self) -> &str {
         &self.text
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
-        (self.output_channels, self.output_spatial)
+        (0, 1) /* ~ changed by cargo-mutants ~ */
     }
     pub fn input_size(&self) -> usize {
         self.input_channels * self.input_spatial * 2
     }
     pub fn output_size(&self) -> usize {
         self.output_channels * self.output_spatial * 2
     }
 }

---- run_without_load_fails stdout ----

thread 'run_without_load_fails' panicked at tests/hardware.rs:71:43:

failures:
    run_without_load_fails

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.93s

*** result: Failure(101)
