*** src/mil/mod.rs:29:9: replace Source::output_shape -> (usize, usize) with (1, 0)

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::output_shape -> (usize, usize) with (1, 0)
@@ -21,17 +21,17 @@
 impl Source {
     pub fn as_str(&self) -> &str {
         &self.text
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
-        (self.output_channels, self.output_spatial)
+        (1, 0) /* ~ changed by cargo-mutants ~ */
     }
     pub fn input_size(&self) -> usize {
         self.input_channels * self.input_spatial * 2
     }
     pub fn output_size(&self) -> usize {
         self.output_channels * self.output_spatial * 2
     }
 }

---- mil_matmul_shape stdout ----

thread 'mil_matmul_shape' panicked at tests/integration.rs:83:5:
assertion `left == right` failed
  left: (1, 0)
 right: (64, 64)

failures:
    mil_matmul_shape

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
