*** src/mil/mod.rs:32:50: replace * with / in Source::input_size

*** mutation diff:
--- src/mil/mod.rs
+++ replace * with / in Source::input_size
@@ -24,17 +24,17 @@
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {
-        self.input_channels * self.input_spatial * 2
+        self.input_channels * self.input_spatial / /* ~ changed by cargo-mutants ~ */ 2
     }
     pub fn output_size(&self) -> usize {
         self.output_channels * self.output_spatial * 2
     }
 }
 
 /// Start a MIL program with header and function signature.
 pub fn mil_header(ic: usize, sp: usize) -> String {

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:37:17:
index out of bounds: the len is 2048 but the index is 2048

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
