*** src/mil/mod.rs:32:9: replace Source::input_size -> usize with 0

*** mutation diff:
--- src/mil/mod.rs
+++ replace Source::input_size -> usize with 0
@@ -24,17 +24,17 @@
     }
     pub fn input_shape(&self) -> (usize, usize) {
         (self.input_channels, self.input_spatial)
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {
-        self.input_channels * self.input_spatial * 2
+        0 /* ~ changed by cargo-mutants ~ */
     }
     pub fn output_size(&self) -> usize {
         self.output_channels * self.output_spatial * 2
     }
 }
 
 /// Start a MIL program with header and function signature.
 pub fn mil_header(ic: usize, sp: usize) -> String {

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:30:45:
called `Result::unwrap()` on an `Err` value: SurfaceCreationFailed("0 bytes (must be 1..=268435456)")

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
