*** src/mil/mod.rs:35:30: replace * with + in Source::output_size

*** mutation diff:
--- src/mil/mod.rs
+++ replace * with + in Source::output_size
@@ -27,17 +27,17 @@
     }
     pub fn output_shape(&self) -> (usize, usize) {
         (self.output_channels, self.output_spatial)
     }
     pub fn input_size(&self) -> usize {
         self.input_channels * self.input_spatial * 2
     }
     pub fn output_size(&self) -> usize {
-        self.output_channels * self.output_spatial * 2
+        self.output_channels + /* ~ changed by cargo-mutants ~ */ self.output_spatial * 2
     }
 }
 
 /// Start a MIL program with header and function signature.
 pub fn mil_header(ic: usize, sp: usize) -> String {
     format!(
         "program(1.3)\n[buildInfo = dict<string, string>({info})]\n{{\n    func main<ios18>(tensor<fp16, [1, {ic}, 1, {sp}]> x) {{\n",
         info=MIL_BUILD_INFO, ic=ic, sp=sp,

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
