*** src/mil/mod.rs:49:5: replace mil_footer -> String with String::new()

*** mutation diff:
--- src/mil/mod.rs
+++ replace mil_footer -> String with String::new()
@@ -41,17 +41,17 @@
     format!(
         "program(1.3)\n[buildInfo = dict<string, string>({info})]\n{{\n    func main<ios18>(tensor<fp16, [1, {ic}, 1, {sp}]> x) {{\n",
         info=MIL_BUILD_INFO, ic=ic, sp=sp,
     )
 }
 
 /// Close a MIL function with output variable.
 pub fn mil_footer(output_var: &str) -> String {
-    format!("    }} -> ({});\n}}\n", output_var)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generate a dynamic matmul block within a MIL function.
 /// Slices activations and weights from input, reshapes, transposes, matmuls.
 /// Returns the output variable name "{prefix}_y".
 pub fn gen_dyn_matmul(
     m: &mut String,
     prefix: &str,

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
