*** src/mil/mod.rs:88:18: replace + with - in matmul

*** mutation diff:
--- src/mil/mod.rs
+++ replace + with - in matmul
@@ -80,17 +80,17 @@
     *m += &format!("        tensor<fp16, [1,1,{seq},{oc}]> {p}_yh = matmul(transpose_x={p}_bF,transpose_y={p}_bF,x={p}_a3,y={p}_W)[name=string(\"{p}_yh\")];\n");
     *m += &format!("        tensor<fp16, [1,1,{oc},{seq}]> {p}_yt = transpose(perm={p}_pm,x={p}_yh)[name=string(\"{p}_yt\")];\n");
     *m += &format!("        tensor<int32, [4]> {p}_ro = const()[name=string(\"{p}_ro\"), val=tensor<int32, [4]>([1,{oc},1,{seq}])];\n");
     *m += &format!("        tensor<fp16, [1,{oc},1,{seq}]> {p}_y = reshape(shape={p}_ro,x={p}_yt)[name=string(\"{p}_y\")];\n");
 }
 
 /// Build a simple dynamic matmul MIL: y = x @ W
 pub fn matmul(ic: usize, oc: usize, seq: usize) -> Source {
-    let sp = seq + oc;
+    let sp = seq - /* ~ changed by cargo-mutants ~ */ oc;
     let mut m = mil_header(ic, sp);
     gen_dyn_matmul(&mut m, "mm", ic, oc, seq, 0, seq, "x");
     m += &mil_footer("mm_y");
     Source {
         text: m,
         input_channels: ic,
         input_spatial: sp,
         output_channels: oc,

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- run_direct_with_unimem_block stdout ----

thread 'run_direct_with_unimem_block' panicked at tests/hardware.rs:154:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- run_without_load_fails stdout ----

thread 'run_without_load_fails' panicked at tests/hardware.rs:69:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
