*** src/model.rs:139:9: replace Program::load -> Result<(), AneError> with Ok(())

*** mutation diff:
--- src/model.rs
+++ replace Program::load -> Result<(), AneError> with Ok(())
@@ -131,32 +131,17 @@
             })
         }
     }
 
     /// Load the compiled model into ANE hardware.
     pub fn load(&mut self) -> Result<(), AneError> {
         // SAFETY: objc_msgSend transmuted to match loadWithQoS:options:error: signature.
         // self.objc_model is valid (created in compile). Error pointer checked on failure.
-        unsafe {
-            let mut error: ObjcId = ptr::null_mut();
-            let ok = msg_send_compile(
-                self.objc_model,
-                "loadWithQoS:options:error:",
-                21,
-                self.empty_dict,
-                &mut error,
-            );
-            if !ok {
-                let msg = nserror_string(error).unwrap_or_else(|| "unknown error".into());
-                return Err(AneError::LoadFailed(msg));
-            }
-            self.loaded = true;
-            Ok(())
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run the model on ANE hardware.
     /// Input and output must be `Buffer` with correct sizes for the MIL program.
     pub fn run(&self, input: &Buffer, output: &Buffer) -> Result<(), AneError> {
         unsafe { self.run_direct(input.as_raw(), output.as_raw()) }
     }

---- run_direct_with_raw_surfaces stdout ----

thread 'run_direct_with_raw_surfaces' panicked at tests/hardware.rs:108:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:45:32:
called `Result::unwrap()` on an `Err` value: EvalFailed("Model not loaded")

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
