*** src/model.rs:148:16: delete ! in Program::load

*** mutation diff:
--- src/model.rs
+++ delete ! in Program::load
@@ -140,17 +140,17 @@
             let mut error: ObjcId = ptr::null_mut();
             let ok = msg_send_compile(
                 self.objc_model,
                 "loadWithQoS:options:error:",
                 21,
                 self.empty_dict,
                 &mut error,
             );
-            if !ok {
+            if  /* ~ changed by cargo-mutants ~ */ok {
                 let msg = nserror_string(error).unwrap_or_else(|| "unknown error".into());
                 return Err(AneError::LoadFailed(msg));
             }
             self.loaded = true;
             Ok(())
         }
     }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:28:18:
called `Result::unwrap()` on an `Err` value: LoadFailed("unknown error")

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
