*** src/model.rs:160:9: replace Program::run -> Result<(), AneError> with Ok(())

*** mutation diff:
--- src/model.rs
+++ replace Program::run -> Result<(), AneError> with Ok(())
@@ -152,17 +152,17 @@
             self.loaded = true;
             Ok(())
         }
     }
 
     /// Run the model on ANE hardware.
     /// Input and output must be `Buffer` with correct sizes for the MIL program.
     pub fn run(&self, input: &Buffer, output: &Buffer) -> Result<(), AneError> {
-        unsafe { self.run_direct(input.as_raw(), output.as_raw()) }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run the model on ANE with raw IOSurfaceRef handles.
     ///
     /// Use this to pass IOSurfaces from external allocators (e.g. cyb-mem)
     /// without wrapping them in Buffer. Zero-copy path.
     ///
     /// # Safety

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:53:9:
identity matmul max_err = 1

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
