*** src/model.rs:204:12: delete ! in Program::unload

*** mutation diff:
--- src/model.rs
+++ delete ! in Program::unload
@@ -196,17 +196,17 @@
             let msg = nserror_string(error).unwrap_or_else(|| "unknown error".into());
             return Err(AneError::EvalFailed(msg));
         }
         Ok(())
     }
 
     /// Unload the model from ANE hardware.
     pub fn unload(&mut self) -> Result<(), AneError> {
-        if !self.loaded {
+        if  /* ~ changed by cargo-mutants ~ */self.loaded {
             return Ok(());
         }
         unsafe {
             let mut error: ObjcId = ptr::null_mut();
             type UnloadFn = unsafe extern "C" fn(ObjcId, ObjcSel, u32, *mut ObjcId) -> bool;
             let f: UnloadFn = std::mem::transmute(objc_msgSend as *const c_void);
             let ok = f(self.objc_model, sel("unloadWithQoS:error:"), 21, &mut error);
             self.loaded = false;

*** result: Success
