*** src/model.rs:213:16: delete ! in Program::unload

*** mutation diff:
--- src/model.rs
+++ delete ! in Program::unload
@@ -205,17 +205,17 @@
             return Ok(());
         }
         unsafe {
             let mut error: ObjcId = ptr::null_mut();
             type UnloadFn = unsafe extern "C" fn(ObjcId, ObjcSel, u32, *mut ObjcId) -> bool;
             let f: UnloadFn = std::mem::transmute(objc_msgSend as *const c_void);
             let ok = f(self.objc_model, sel("unloadWithQoS:error:"), 21, &mut error);
             self.loaded = false;
-            if !ok {
+            if  /* ~ changed by cargo-mutants ~ */ok {
                 let msg = nserror_string(error).unwrap_or_else(|| "unknown error".into());
                 return Err(AneError::UnloadFailed(msg));
             }
             Ok(())
         }
     }
 }

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:16:20:
called `Result::unwrap()` on an `Err` value: UnloadFailed("unknown error")

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
