*** src/model.rs:232:5: replace load_ane_frameworks with ()

*** mutation diff:
--- src/model.rs
+++ replace load_ane_frameworks with ()
@@ -224,30 +224,17 @@
         let _ = self.unload();
         let _ = std::fs::remove_dir_all(&self.tmp_dir);
     }
 }
 
 // ── Internal helpers ──
 
 fn load_ane_frameworks() {
-    use std::sync::Once;
-    static INIT: Once = Once::new();
-    INIT.call_once(|| {
-        for name in &["AppleNeuralEngine", "ANECompiler", "ANEServices"] {
-            let path = format!(
-                "/System/Library/PrivateFrameworks/{}.framework/{}",
-                name, name
-            );
-            let c = std::ffi::CString::new(path).unwrap();
-            unsafe {
-                dlopen(c.as_ptr(), RTLD_NOW);
-            }
-        }
-    });
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn objc_nsstring_to_rust(obj: ObjcId) -> Option<String> {
     if obj.is_null() {
         return None;
     }
     unsafe {
         type F = unsafe extern "C" fn(ObjcId, ObjcSel) -> *const c_char;

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:
called `Result::unwrap()` on an `Err` value: ClassNotFound("_ANEInMemoryModelDescriptor")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
