*** src/model.rs:249:5: replace objc_nsstring_to_rust -> Option<String> with Some(String::new())

*** mutation diff:
--- src/model.rs
+++ replace objc_nsstring_to_rust -> Option<String> with Some(String::new())
@@ -241,28 +241,17 @@
             unsafe {
                 dlopen(c.as_ptr(), RTLD_NOW);
             }
         }
     });
 }
 
 fn objc_nsstring_to_rust(obj: ObjcId) -> Option<String> {
-    if obj.is_null() {
-        return None;
-    }
-    unsafe {
-        type F = unsafe extern "C" fn(ObjcId, ObjcSel) -> *const c_char;
-        let f: F = std::mem::transmute(objc_msgSend as *const c_void);
-        let cstr = f(obj, sel("UTF8String"));
-        if cstr.is_null() {
-            return None;
-        }
-        Some(CStr::from_ptr(cstr).to_string_lossy().into_owned())
-    }
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 unsafe fn msg_send_0(target: ObjcId, selector: &str) -> ObjcId {
     type F = unsafe extern "C" fn(ObjcId, ObjcSel) -> ObjcId;
     let f: F = std::mem::transmute(objc_msgSend as *const c_void);
     f(target, sel(selector))
 }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
