*** src/model.rs:300:5: replace build_weights_dict -> ObjcId with Default::default()

*** mutation diff:
--- src/model.rs
+++ replace build_weights_dict -> ObjcId with Default::default()
@@ -292,43 +292,17 @@
     err: *mut ObjcId,
 ) -> bool {
     type F = unsafe extern "C" fn(ObjcId, ObjcSel, u32, ObjcId, *mut ObjcId) -> bool;
     let f: F = std::mem::transmute(objc_msgSend as *const c_void);
     f(target, sel(selector), qos, opts, err)
 }
 
 fn build_weights_dict(weights: &[(&str, &[u8])]) -> ObjcId {
-    unsafe {
-        if weights.is_empty() {
-            return msg_send_0(cls("NSDictionary") as ObjcId, "dictionary");
-        }
-        // For each weight entry, create nested dict: { "offset": 0, "data": NSData }
-        let cls_nsdict = cls("NSMutableDictionary");
-        let dict: ObjcId = msg_send_0(cls_nsdict as ObjcId, "dictionary");
-        for &(path, data) in weights {
-            let key = nsstring(path);
-            let inner: ObjcId = msg_send_0(cls_nsdict as ObjcId, "dictionary");
-            let offset_key = nsstring("offset");
-            let data_key = nsstring("data");
-            let zero: ObjcId = msg_send_1(cls("NSNumber") as ObjcId, "numberWithInt:", 0i32);
-            let nsdata = msg_send_2::<*const u8, u64>(
-                cls("NSData") as ObjcId,
-                "dataWithBytes:length:",
-                data.as_ptr(),
-                data.len() as u64,
-            );
-            type SetF = unsafe extern "C" fn(ObjcId, ObjcSel, ObjcId, ObjcId);
-            let set: SetF = std::mem::transmute(objc_msgSend as *const c_void);
-            set(inner, sel("setObject:forKey:"), zero, offset_key);
-            set(inner, sel("setObject:forKey:"), nsdata, data_key);
-            set(dict, sel("setObject:forKey:"), inner, key);
-        }
-        dict
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn nsstring(s: &str) -> ObjcId {
     unsafe {
         let cstr = std::ffi::CString::new(s).unwrap();
         type F = unsafe extern "C" fn(ObjcId, ObjcSel, *const c_char) -> ObjcId;
         let f: F = std::mem::transmute(objc_msgSend as *const c_void);
         f(

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:14:47:
called `Result::unwrap()` on an `Err` value: DescriptorCreationFailed

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:21:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
