*** src/model.rs:98:20: delete ! in Program::compile

*** mutation diff:
--- src/model.rs
+++ delete ! in Program::compile
@@ -90,17 +90,17 @@
             std::fs::write(tmp_dir.join("model.mil"), program.as_str())
                 .map_err(|e| AneError::CompilationFailed(format!("Failed to write MIL: {}", e)))?;
 
             // Write weight blobs to temp dir
             for &(path, data) in weights {
                 let rel = path.replace("@model_path/", "");
                 let full = tmp_dir.join(&rel);
                 // Prevent path traversal: resolved path must stay inside tmp_dir
-                if !full.starts_with(&tmp_dir) {
+                if  /* ~ changed by cargo-mutants ~ */full.starts_with(&tmp_dir) {
                     return Err(AneError::CompilationFailed(format!(
                         "Path traversal in weight path: {}",
                         rel
                     )));
                 }
                 if let Some(parent) = full.parent() {
                     let _ = std::fs::create_dir_all(parent);
                 }

*** result: Success
