*** src/probe/compile.rs:104:12: delete ! in level7_mil_compile

*** mutation diff:
--- src/probe/compile.rs
+++ delete ! in level7_mil_compile
@@ -96,17 +96,17 @@
             "        tensor<fp16, [1,{oc},1,{seq}]> y = reshape(shape=ro,x=yt)[name=string(\"y\")];\n",
             "    }} -> (y);\n",
             "}}\n"
         ),
         ic=ic, oc=oc, seq=seq, sp=sp
     );
     println!("  MIL program ({} bytes):", mil.len());
     for line in mil.lines() {
-        if !line.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */line.is_empty() {
             println!("    {}", line);
         }
     }
 
     // ── Step 2: Try ANECCompile C API first ──
     println!("\n  ── Approach A: ANECCompile (pure C) ──\n");
     let approach_a_ok = try_anec_compile(&mil);

*** result: Success
