*** src/probe/compile.rs:113:8: delete ! in level7_mil_compile

*** mutation diff:
--- src/probe/compile.rs
+++ delete ! in level7_mil_compile
@@ -105,17 +105,17 @@
             println!("    {}", line);
         }
     }
 
     // ── Step 2: Try ANECCompile C API first ──
     println!("\n  ── Approach A: ANECCompile (pure C) ──\n");
     let approach_a_ok = try_anec_compile(&mil);
 
-    if !approach_a_ok {
+    if  /* ~ changed by cargo-mutants ~ */approach_a_ok {
         // ── Step 3: ObjC runtime path ──
         println!("\n  ── Approach B: ObjC runtime from Rust ──\n");
         try_objc_compile(&mil);
     }
 }
 
 fn try_anec_compile(_mil: &str) -> bool {
     // ANECCreateCompilerInputDictionary/OptionDictionary hang when called

*** result: Success
