*** src/probe/compile.rs:124:5: replace try_anec_compile -> bool with false

*** mutation diff:
--- src/probe/compile.rs
+++ replace try_anec_compile -> bool with false
@@ -116,19 +116,17 @@
         try_objc_compile(&mil);
     }
 }
 
 fn try_anec_compile(_mil: &str) -> bool {
     // ANECCreateCompilerInputDictionary/OptionDictionary hang when called
     // with no args — they likely require arguments we don't know yet.
     // Skip pure C API for now, go straight to ObjC runtime path.
-    println!("  [~] Skipping ANECCompile C API (helper functions require");
-    println!("      unknown arguments). Using ObjC runtime instead.");
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn try_objc_compile(mil: &str) -> bool {
     println!("  Using ObjC runtime from Rust (objc_msgSend — same as training code)");
     println!("  No ObjC compiler needed — just C FFI to libobjc\n");
 
     unsafe {
         // Get ObjC classes

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:
called `Result::unwrap()` on an `Err` value: CompilationFailed("Error Domain=com.apple.appleneuralengine Code=9 \"issueSandboxExtensionForPath:error:: file access failure\" UserInfo={NSLocalizedDescription=issueSandboxExtensionForPath:error:: file access failure}")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
