*** src/probe/compile.rs:130:5: replace try_objc_compile -> bool with false

*** mutation diff:
--- src/probe/compile.rs
+++ replace try_objc_compile -> bool with false
@@ -122,162 +122,10 @@
     // with no args — they likely require arguments we don't know yet.
     // Skip pure C API for now, go straight to ObjC runtime path.
     println!("  [~] Skipping ANECCompile C API (helper functions require");
     println!("      unknown arguments). Using ObjC runtime instead.");
     false
 }
 
 fn try_objc_compile(mil: &str) -> bool {
-    println!("  Using ObjC runtime from Rust (objc_msgSend — same as training code)");
-    println!("  No ObjC compiler needed — just C FFI to libobjc\n");
-
-    unsafe {
-        // Get ObjC classes
-        let cls_descriptor = cls("_ANEInMemoryModelDescriptor");
-        let cls_model = cls("_ANEInMemoryModel");
-
-        if cls_descriptor.is_null() {
-            println!("  [-] _ANEInMemoryModelDescriptor class not found");
-            println!("      AppleNeuralEngine.framework might not export it");
-            return false;
-        }
-        println!("  [+] _ANEInMemoryModelDescriptor @ {:?}", cls_descriptor);
-
-        if cls_model.is_null() {
-            println!("  [-] _ANEInMemoryModel class not found");
-            return false;
-        }
-        println!("  [+] _ANEInMemoryModel @ {:?}", cls_model);
-
-        // Create NSData from MIL text
-        let cls_nsdata = cls("NSData");
-        let mil_bytes = mil.as_bytes();
-        let data_init: MsgSendDataInit = std::mem::transmute(objc_msgSend as *const c_void);
-        let mil_data = data_init(
-            cls_nsdata as *const c_void as *mut c_void,
-            sel("dataWithBytes:length:"),
-            mil_bytes.as_ptr(),
-            mil_bytes.len() as u64,
-        );
-        if mil_data.is_null() {
-            println!("  [-] Failed to create NSData from MIL text");
-            return false;
-        }
-        println!("  [+] NSData(MIL) created ({} bytes)", mil_bytes.len());
-
-        // Create empty NSDictionary for weights (identity has no weights)
-        let cls_nsdict = cls("NSDictionary");
-        let dict_init: MsgSendInit = std::mem::transmute(objc_msgSend as *const c_void);
-        let empty_weights = dict_init(
-            cls_nsdict as *const c_void as *mut c_void,
-            sel("dictionary"),
-        );
-        println!("  [+] Empty weights dict created");
-
-        // _ANEInMemoryModelDescriptor.modelWithMILText:weights:optionsPlist:
-        println!("\n  [*] Creating model descriptor...");
-        let create_desc: MsgSendDesc = std::mem::transmute(objc_msgSend as *const c_void);
-        let descriptor = create_desc(
-            cls_descriptor as *const c_void as *mut c_void,
-            sel("modelWithMILText:weights:optionsPlist:"),
-            mil_data,
-            empty_weights,
-            ptr::null_mut(), // nil options
-        );
-        if descriptor.is_null() {
-            println!("  [-] modelWithMILText:weights:optionsPlist: returned nil");
-            return false;
-        }
-        println!("  [+] Descriptor created!");
-
-        // _ANEInMemoryModel.inMemoryModelWithDescriptor:
-        println!("  [*] Creating in-memory model...");
-        let create_model: MsgSendModel = std::mem::transmute(objc_msgSend as *const c_void);
-        let model = create_model(
-            cls_model as *const c_void as *mut c_void,
-            sel("inMemoryModelWithDescriptor:"),
-            descriptor,
-        );
-        if model.is_null() {
-            println!("  [-] inMemoryModelWithDescriptor: returned nil");
-            return false;
-        }
-        println!("  [+] Model created!");
-
-        // Get hex identifier for temp dir
-        let get_str: MsgSendStr = std::mem::transmute(objc_msgSend as *const c_void);
-        let hex_id = get_str(model, sel("hexStringIdentifier"));
-        let hex_str = if !hex_id.is_null() {
-            let utf8_fn: MsgSendUtf8 = std::mem::transmute(objc_msgSend as *const c_void);
-            let cstr = utf8_fn(hex_id, sel("UTF8String"));
-            if !cstr.is_null() {
-                CStr::from_ptr(cstr).to_string_lossy().into_owned()
-            } else {
-                "unknown".to_string()
-            }
-        } else {
-            "unknown".to_string()
-        };
-        println!("  [+] Model hex ID: {}", hex_str);
-
-        // Set up temp directory (model.mil + weights/)
-        let tmp_dir = std::env::temp_dir().join(&hex_str);
-        let _ = std::fs::create_dir_all(tmp_dir.join("weights"));
-        std::fs::write(tmp_dir.join("model.mil"), mil).unwrap();
-        println!("  [+] Temp dir: {:?}", tmp_dir);
-
-        // Compile: model.compileWithQoS:options:error:
-        println!("\n  [*] *** COMPILING MIL → ANE BYTECODE ***");
-        let mut error: ObjcId = ptr::null_mut();
-        let compile_fn: MsgSendCompile = std::mem::transmute(objc_msgSend as *const c_void);
-        let ok = compile_fn(
-            model,
-            sel("compileWithQoS:options:error:"),
-            21,            // QoS
-            empty_weights, // options (empty dict)
-            &mut error,
-        );
-
-        if ok {
-            println!("  [+] *** COMPILATION SUCCEEDED! ***");
-            println!("      MIL → ANE bytecode compiled from pure Rust!");
-
-            // Check what files were produced
-            if let Ok(entries) = std::fs::read_dir(&tmp_dir) {
-                for entry in entries.flatten() {
-                    let name = entry.file_name();
-                    let size = entry.metadata().map(|m| m.len()).unwrap_or(0);
-                    println!("      {:?}: {} bytes", name, size);
-                    // Recurse one level for subdirs
-                    if entry.file_type().map(|t| t.is_dir()).unwrap_or(false) {
-                        if let Ok(sub) = std::fs::read_dir(entry.path()) {
-                            for se in sub.flatten() {
-                                let sname = se.file_name();
-                                let ssize = se.metadata().map(|m| m.len()).unwrap_or(0);
-                                println!("        {:?}: {} bytes", sname, ssize);
-                            }
-                        }
-                    }
-                }
-            }
-
-            // Load + evaluate + verify
-            load_eval_verify(model, empty_weights, compile_fn, &tmp_dir);
-
-            true
-        } else {
-            println!("  [-] Compilation failed");
-            if !error.is_null() {
-                let desc_fn: MsgSendStr = std::mem::transmute(objc_msgSend as *const c_void);
-                let desc = desc_fn(error, sel("description"));
-                if !desc.is_null() {
-                    let utf8_fn: MsgSendUtf8 = std::mem::transmute(objc_msgSend as *const c_void);
-                    let cstr = utf8_fn(desc, sel("UTF8String"));
-                    if !cstr.is_null() {
-                        println!("      Error: {}", CStr::from_ptr(cstr).to_string_lossy());
-                    }
-                }
-            }
-            false
-        }
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
