*** src/probe/compile.rs:17:5: replace pack_weights -> Vec<u8> with vec![1]

*** mutation diff:
--- src/probe/compile.rs
+++ replace pack_weights -> Vec<u8> with vec![1]
@@ -9,38 +9,17 @@
 // Weight blob builder
 // ============================================================
 
 /// Build ANE weight blob: 128-byte header + fp16 data
 /// Header format from training_dynamic/io.h build_blob():
 ///   byte 0: 1, byte 4: 2, bytes 64-67: 0xDEADBEEF, byte 68: 1
 ///   bytes 72-75: weight_size_bytes, bytes 80-83: 128 (data offset)
 pub(crate) fn pack_weights(fp16_data: &[u16]) -> Vec<u8> {
-    let weight_bytes = fp16_data.len() * 2;
-    let total = 128 + weight_bytes;
-    let mut blob = vec![0u8; total];
-
-    blob[0] = 1;
-    blob[4] = 2;
-    // DEADBEEF magic
-    blob[64] = 0xEF;
-    blob[65] = 0xBE;
-    blob[66] = 0xAD;
-    blob[67] = 0xDE;
-    blob[68] = 1;
-    // Weight size in bytes
-    blob[72..76].copy_from_slice(&(weight_bytes as u32).to_le_bytes());
-    // Data offset
-    blob[80..84].copy_from_slice(&128u32.to_le_bytes());
-    // Copy fp16 data
-    for (i, &val) in fp16_data.iter().enumerate() {
-        let off = 128 + i * 2;
-        blob[off..off + 2].copy_from_slice(&val.to_le_bytes());
-    }
-    blob
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 // ============================================================
 // ObjC runtime msg_send type aliases (used during compilation)
 // ============================================================
 
 type MsgSendInit = unsafe extern "C" fn(ObjcClass, ObjcSel) -> ObjcId;
 type MsgSendDataInit = unsafe extern "C" fn(ObjcClass, ObjcSel, *const u8, u64) -> ObjcId;

*** result: Success
