*** src/probe/compile.rs:18:21: replace + with - in pack_weights

*** mutation diff:
--- src/probe/compile.rs
+++ replace + with - in pack_weights
@@ -10,17 +10,17 @@
 // ============================================================
 
 /// Build ANE weight blob: 128-byte header + fp16 data
 /// Header format from training_dynamic/io.h build_blob():
 ///   byte 0: 1, byte 4: 2, bytes 64-67: 0xDEADBEEF, byte 68: 1
 ///   bytes 72-75: weight_size_bytes, bytes 80-83: 128 (data offset)
 pub(crate) fn pack_weights(fp16_data: &[u16]) -> Vec<u8> {
     let weight_bytes = fp16_data.len() * 2;
-    let total = 128 + weight_bytes;
+    let total = 128 - /* ~ changed by cargo-mutants ~ */ weight_bytes;
     let mut blob = vec![0u8; total];
 
     blob[0] = 1;
     blob[4] = 2;
     // DEADBEEF magic
     blob[64] = 0xEF;
     blob[65] = 0xBE;
     blob[66] = 0xAD;

*** result: Success
