*** src/probe/compile.rs:209:26: delete ! in try_objc_compile

*** mutation diff:
--- src/probe/compile.rs
+++ delete ! in try_objc_compile
@@ -201,17 +201,17 @@
             println!("  [-] inMemoryModelWithDescriptor: returned nil");
             return false;
         }
         println!("  [+] Model created!");
 
         // Get hex identifier for temp dir
         let get_str: MsgSendStr = std::mem::transmute(objc_msgSend as *const c_void);
         let hex_id = get_str(model, sel("hexStringIdentifier"));
-        let hex_str = if !hex_id.is_null() {
+        let hex_str = if  /* ~ changed by cargo-mutants ~ */hex_id.is_null() {
             let utf8_fn: MsgSendUtf8 = std::mem::transmute(objc_msgSend as *const c_void);
             let cstr = utf8_fn(hex_id, sel("UTF8String"));
             if !cstr.is_null() {
                 CStr::from_ptr(cstr).to_string_lossy().into_owned()
             } else {
                 "unknown".to_string()
             }
         } else {

*** result: Success
