*** src/probe/compile.rs:272:20: delete ! in try_objc_compile

*** mutation diff:
--- src/probe/compile.rs
+++ delete ! in try_objc_compile
@@ -264,17 +264,17 @@
             load_eval_verify(model, empty_weights, compile_fn, &tmp_dir);
 
             true
         } else {
             println!("  [-] Compilation failed");
             if !error.is_null() {
                 let desc_fn: MsgSendStr = std::mem::transmute(objc_msgSend as *const c_void);
                 let desc = desc_fn(error, sel("description"));
-                if !desc.is_null() {
+                if  /* ~ changed by cargo-mutants ~ */desc.is_null() {
                     let utf8_fn: MsgSendUtf8 = std::mem::transmute(objc_msgSend as *const c_void);
                     let cstr = utf8_fn(desc, sel("UTF8String"));
                     if !cstr.is_null() {
                         println!("      Error: {}", CStr::from_ptr(cstr).to_string_lossy());
                     }
                 }
             }
             false

*** result: Success
