*** src/probe/compile.rs:36:23: replace + with - in pack_weights

*** mutation diff:
--- src/probe/compile.rs
+++ replace + with - in pack_weights
@@ -28,17 +28,17 @@
     blob[68] = 1;
     // Weight size in bytes
     blob[72..76].copy_from_slice(&(weight_bytes as u32).to_le_bytes());
     // Data offset
     blob[80..84].copy_from_slice(&128u32.to_le_bytes());
     // Copy fp16 data
     for (i, &val) in fp16_data.iter().enumerate() {
         let off = 128 + i * 2;
-        blob[off..off + 2].copy_from_slice(&val.to_le_bytes());
+        blob[off..off - /* ~ changed by cargo-mutants ~ */ 2].copy_from_slice(&val.to_le_bytes());
     }
     blob
 }
 
 // ============================================================
 // ObjC runtime msg_send type aliases (used during compilation)
 // ============================================================

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:
called `Result::unwrap()` on an `Err` value: CompilationFailed("Error Domain=com.apple.appleneuralengine Code=9 \"issueSandboxExtensionForPath:error:: file access failure\" UserInfo={NSLocalizedDescription=issueSandboxExtensionForPath:error:: file access failure}")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
