*** src/probe/compile.rs:57:5: replace level7_mil_compile with ()

*** mutation diff:
--- src/probe/compile.rs
+++ replace level7_mil_compile with ()
@@ -49,77 +49,17 @@
 type MsgSendStr = unsafe extern "C" fn(ObjcId, ObjcSel) -> ObjcId;
 type MsgSendUtf8 = unsafe extern "C" fn(ObjcId, ObjcSel) -> *const c_char;
 
 // ============================================================
 // Level 7: Compile MIL -> ANE bytecode
 // ============================================================
 
 pub(crate) fn level7_mil_compile() {
-    println!("\n═══════════════════════════════════════════════════");
-    println!("  LEVEL 7: MIL → ANE Bytecode (Pure Rust)");
-    println!("═══════════════════════════════════════════════════\n");
-
-    // ── Step 1: Minimal MIL program ──
-    // Dynamic matmul: y = x @ W (exact format from training_dynamic/mil_dynamic.h)
-    // Input: [1, 64, 1, 128] — first 64 cols = activations, last 64 = weights
-    // Output: [1, 64, 1, 64] — matmul result
-    let ic = 64;
-    let oc = 64;
-    let seq = 64;
-    let sp = seq + oc; // 128
-
-    let mil = format!(
-        concat!(
-            "program(1.3)\n",
-            "[buildInfo = dict<string, string>(",
-            "{{{{\"coremlc-component-MIL\", \"3510.2.1\"}}, ",
-            "{{\"coremlc-version\", \"3505.4.1\"}}, ",
-            "{{\"coremltools-component-milinternal\", \"\"}}, ",
-            "{{\"coremltools-version\", \"9.0\"}}}}",
-            ")]\n{{\n",
-            "    func main<ios18>(tensor<fp16, [1, {ic}, 1, {sp}]> x) {{\n",
-            "        tensor<int32, [4]> ba = const()[name=string(\"ba\"), val=tensor<int32, [4]>([0,0,0,0])];\n",
-            "        tensor<int32, [4]> sa = const()[name=string(\"sa\"), val=tensor<int32, [4]>([1,{ic},1,{seq}])];\n",
-            "        tensor<fp16, [1,{ic},1,{seq}]> act = slice_by_size(x=x,begin=ba,size=sa)[name=string(\"act\")];\n",
-            "        tensor<int32, [4]> bw = const()[name=string(\"bw\"), val=tensor<int32, [4]>([0,0,0,{seq}])];\n",
-            "        tensor<int32, [4]> sw = const()[name=string(\"sw\"), val=tensor<int32, [4]>([1,{ic},1,{oc}])];\n",
-            "        tensor<fp16, [1,{ic},1,{oc}]> wt = slice_by_size(x=x,begin=bw,size=sw)[name=string(\"wt\")];\n",
-            "        tensor<int32, [4]> ra = const()[name=string(\"ra\"), val=tensor<int32, [4]>([1,1,{ic},{seq}])];\n",
-            "        tensor<fp16, [1,1,{ic},{seq}]> a2 = reshape(shape=ra,x=act)[name=string(\"a2\")];\n",
-            "        tensor<int32, [4]> pm = const()[name=string(\"pm\"), val=tensor<int32, [4]>([0,1,3,2])];\n",
-            "        tensor<fp16, [1,1,{seq},{ic}]> a3 = transpose(perm=pm,x=a2)[name=string(\"a3\")];\n",
-            "        tensor<int32, [4]> rw = const()[name=string(\"rw\"), val=tensor<int32, [4]>([1,1,{ic},{oc}])];\n",
-            "        tensor<fp16, [1,1,{ic},{oc}]> W = reshape(shape=rw,x=wt)[name=string(\"W\")];\n",
-            "        bool bF = const()[name=string(\"bF\"), val=bool(false)];\n",
-            "        tensor<fp16, [1,1,{seq},{oc}]> yh = matmul(transpose_x=bF,transpose_y=bF,x=a3,y=W)[name=string(\"yh\")];\n",
-            "        tensor<fp16, [1,1,{oc},{seq}]> yt = transpose(perm=pm,x=yh)[name=string(\"yt\")];\n",
-            "        tensor<int32, [4]> ro = const()[name=string(\"ro\"), val=tensor<int32, [4]>([1,{oc},1,{seq}])];\n",
-            "        tensor<fp16, [1,{oc},1,{seq}]> y = reshape(shape=ro,x=yt)[name=string(\"y\")];\n",
-            "    }} -> (y);\n",
-            "}}\n"
-        ),
-        ic=ic, oc=oc, seq=seq, sp=sp
-    );
-    println!("  MIL program ({} bytes):", mil.len());
-    for line in mil.lines() {
-        if !line.is_empty() {
-            println!("    {}", line);
-        }
-    }
-
-    // ── Step 2: Try ANECCompile C API first ──
-    println!("\n  ── Approach A: ANECCompile (pure C) ──\n");
-    let approach_a_ok = try_anec_compile(&mil);
-
-    if !approach_a_ok {
-        // ── Step 3: ObjC runtime path ──
-        println!("\n  ── Approach B: ObjC runtime from Rust ──\n");
-        try_objc_compile(&mil);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn try_anec_compile(_mil: &str) -> bool {
     // ANECCreateCompilerInputDictionary/OptionDictionary hang when called
     // with no args — they likely require arguments we don't know yet.
     // Skip pure C API for now, go straight to ObjC runtime path.
     println!("  [~] Skipping ANECCompile C API (helper functions require");
     println!("      unknown arguments). Using ObjC runtime instead.");

*** result: Success
