*** src/probe/compile.rs:68:18: replace + with - in level7_mil_compile

*** mutation diff:
--- src/probe/compile.rs
+++ replace + with - in level7_mil_compile
@@ -60,17 +60,17 @@
 
     // ── Step 1: Minimal MIL program ──
     // Dynamic matmul: y = x @ W (exact format from training_dynamic/mil_dynamic.h)
     // Input: [1, 64, 1, 128] — first 64 cols = activations, last 64 = weights
     // Output: [1, 64, 1, 64] — matmul result
     let ic = 64;
     let oc = 64;
     let seq = 64;
-    let sp = seq + oc; // 128
+    let sp = seq - /* ~ changed by cargo-mutants ~ */ oc; // 128
 
     let mil = format!(
         concat!(
             "program(1.3)\n",
             "[buildInfo = dict<string, string>(",
             "{{{{\"coremlc-component-MIL\", \"3510.2.1\"}}, ",
             "{{\"coremlc-version\", \"3505.4.1\"}}, ",
             "{{\"coremltools-component-milinternal\", \"\"}}, ",

*** result: Success
