*** src/probe/discovery.rs:139:48: replace != with == in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace != with == in level3_probe
@@ -131,17 +131,17 @@
                 0,
                 out_buf.as_mut_ptr() as *mut c_void,
                 &mut out_size,
             );
 
             // Only print if something interesting happened
             const MIG_BAD_ID: i32 = 0xfffffbc4_u32 as i32;
             let scalar_interesting = kr_scalar != KIO_BAD_ARG && kr_scalar != MIG_BAD_ID;
-            let struct_interesting = kr_struct != KIO_BAD_ARG && kr_struct != MIG_BAD_ID;
+            let struct_interesting = kr_struct == /* ~ changed by cargo-mutants ~ */ KIO_BAD_ARG && kr_struct != MIG_BAD_ID;
 
             if scalar_interesting || struct_interesting {
                 print!("  sel {:2}:", selector);
                 if scalar_interesting {
                     if kr_scalar == KERN_SUCCESS {
                         print!(
                             " scalar=OK({}:{:?})",
                             output_cnt,

*** result: Success
