*** src/probe/discovery.rs:139:63: replace && with || in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace && with || in level3_probe
@@ -131,17 +131,17 @@
                 0,
                 out_buf.as_mut_ptr() as *mut c_void,
                 &mut out_size,
             );
 
             // Only print if something interesting happened
             const MIG_BAD_ID: i32 = 0xfffffbc4_u32 as i32;
             let scalar_interesting = kr_scalar != KIO_BAD_ARG && kr_scalar != MIG_BAD_ID;
-            let struct_interesting = kr_struct != KIO_BAD_ARG && kr_struct != MIG_BAD_ID;
+            let struct_interesting = kr_struct != KIO_BAD_ARG || /* ~ changed by cargo-mutants ~ */ kr_struct != MIG_BAD_ID;
 
             if scalar_interesting || struct_interesting {
                 print!("  sel {:2}:", selector);
                 if scalar_interesting {
                     if kr_scalar == KERN_SUCCESS {
                         print!(
                             " scalar=OK({}:{:?})",
                             output_cnt,

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:
called `Result::unwrap()` on an `Err` value: CompilationFailed("Error Domain=com.apple.appleneuralengine Code=9 \"issueSandboxExtensionForPath:error:: file access failure\" UserInfo={NSLocalizedDescription=issueSandboxExtensionForPath:error:: file access failure}")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
