*** src/probe/discovery.rs:141:35: replace || with && in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace || with && in level3_probe
@@ -133,17 +133,17 @@
                 &mut out_size,
             );
 
             // Only print if something interesting happened
             const MIG_BAD_ID: i32 = 0xfffffbc4_u32 as i32;
             let scalar_interesting = kr_scalar != KIO_BAD_ARG && kr_scalar != MIG_BAD_ID;
             let struct_interesting = kr_struct != KIO_BAD_ARG && kr_struct != MIG_BAD_ID;
 
-            if scalar_interesting || struct_interesting {
+            if scalar_interesting && /* ~ changed by cargo-mutants ~ */ struct_interesting {
                 print!("  sel {:2}:", selector);
                 if scalar_interesting {
                     if kr_scalar == KERN_SUCCESS {
                         print!(
                             " scalar=OK({}:{:?})",
                             output_cnt,
                             &output[..output_cnt as usize]
                         );

*** result: Success
