*** src/probe/discovery.rs:144:34: replace == with != in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace == with != in level3_probe
@@ -136,17 +136,17 @@
             // Only print if something interesting happened
             const MIG_BAD_ID: i32 = 0xfffffbc4_u32 as i32;
             let scalar_interesting = kr_scalar != KIO_BAD_ARG && kr_scalar != MIG_BAD_ID;
             let struct_interesting = kr_struct != KIO_BAD_ARG && kr_struct != MIG_BAD_ID;
 
             if scalar_interesting || struct_interesting {
                 print!("  sel {:2}:", selector);
                 if scalar_interesting {
-                    if kr_scalar == KERN_SUCCESS {
+                    if kr_scalar != /* ~ changed by cargo-mutants ~ */ KERN_SUCCESS {
                         print!(
                             " scalar=OK({}:{:?})",
                             output_cnt,
                             &output[..output_cnt as usize]
                         );
                     } else {
                         print!(" scalar={}", kern_err(kr_scalar));
                     }

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:14:47:

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
