*** src/probe/discovery.rs:155:34: replace == with != in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace == with != in level3_probe
@@ -147,17 +147,17 @@
                             output_cnt,
                             &output[..output_cnt as usize]
                         );
                     } else {
                         print!(" scalar={}", kern_err(kr_scalar));
                     }
                 }
                 if struct_interesting {
-                    if kr_struct == KERN_SUCCESS {
+                    if kr_struct != /* ~ changed by cargo-mutants ~ */ KERN_SUCCESS {
                         print!(" struct=OK({} bytes)", out_size);
                         if out_size > 0 && out_size <= 64 {
                             print!(" data={:02x?}", &out_buf[..out_size]);
                         }
                     } else {
                         print!(" struct={}", kern_err(kr_struct));
                     }
                 }

*** result: Success
