*** src/probe/discovery.rs:157:53: replace <= with > in level3_probe

*** mutation diff:
--- src/probe/discovery.rs
+++ replace <= with > in level3_probe
@@ -149,17 +149,17 @@
                         );
                     } else {
                         print!(" scalar={}", kern_err(kr_scalar));
                     }
                 }
                 if struct_interesting {
                     if kr_struct == KERN_SUCCESS {
                         print!(" struct=OK({} bytes)", out_size);
-                        if out_size > 0 && out_size <= 64 {
+                        if out_size > 0 && out_size > /* ~ changed by cargo-mutants ~ */ 64 {
                             print!(" data={:02x?}", &out_buf[..out_size]);
                         }
                     } else {
                         print!(" struct={}", kern_err(kr_struct));
                     }
                 }
                 println!();
             }

*** result: Success
