*** src/probe/discovery.rs:175:5: replace level4_surface -> Option<IOSurfaceRef> with None

*** mutation diff:
--- src/probe/discovery.rs
+++ replace level4_surface -> Option<IOSurfaceRef> with None
@@ -167,69 +167,17 @@
     }
 }
 
 // ============================================================
 // Level 4: IOSurface creation
 // ============================================================
 
 pub(crate) fn level4_surface() -> Option<IOSurfaceRef> {
-    println!("\n═══════════════════════════════════════════════════");
-    println!("  LEVEL 4: IOSurface (ANE tensor buffer)");
-    println!("═══════════════════════════════════════════════════\n");
-
-    unsafe {
-        let dict = CFDictionaryCreateMutable(
-            ptr::null(),
-            0,
-            &kCFTypeDictionaryKeyCallBacks as *const c_void,
-            &kCFTypeDictionaryValueCallBacks as *const c_void,
-        );
-
-        // ANE native format: [1, C, 1, S] where C=channels, S=spatial
-        // Map to IOSurface: width=S, height=1, bytesPerElement=C*2 (fp16)
-        let channels: i32 = 64;
-        let spatial: i32 = 64;
-        let bpe: i32 = channels * 2;
-
-        CFDictionarySetValue(dict, cf_str("IOSurfaceWidth") as _, cf_num(spatial));
-        CFDictionarySetValue(dict, cf_str("IOSurfaceHeight") as _, cf_num(1));
-        CFDictionarySetValue(dict, cf_str("IOSurfaceBytesPerElement") as _, cf_num(bpe));
-        CFDictionarySetValue(dict, cf_str("IOSurfacePixelFormat") as _, cf_num(0));
-
-        let surface = IOSurfaceCreate(dict);
-        if surface.is_null() {
-            println!("  [-] IOSurfaceCreate FAILED");
-            return None;
-        }
-
-        let alloc = IOSurfaceGetAllocSize(surface);
-        let sid = IOSurfaceGetID(surface);
-        println!("  [+] IOSurface created from pure Rust!");
-        println!("      ID     = {}", sid);
-        println!(
-            "      Size   = {} bytes ({:.1} KB)",
-            alloc,
-            alloc as f64 / 1024.0
-        );
-        println!("      Shape  = [1, {}, 1, {}] fp16", channels, spatial);
-
-        // Write recognizable pattern
-        IOSurfaceLock(surface, 0, ptr::null_mut());
-        let base = IOSurfaceGetBaseAddress(surface) as *mut u16;
-        if !base.is_null() {
-            for i in 0..(channels * spatial) as usize {
-                *base.add(i) = 0x3C00; // fp16(1.0)
-            }
-            println!("      Wrote {} fp16 values = 1.0 each", channels * spatial);
-        }
-        IOSurfaceUnlock(surface, 0, ptr::null_mut());
-
-        Some(surface)
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Helper: create IOSurface of given byte size
 pub(crate) fn level4_make_surface(bytes: usize) -> IOSurfaceRef {
     unsafe {
         let dict = CFDictionaryCreateMutable(
             ptr::null(),
             0,

*** result: Success
