*** src/probe/discovery.rs:191:33: replace * with / in level4_surface

*** mutation diff:
--- src/probe/discovery.rs
+++ replace * with / in level4_surface
@@ -183,17 +183,17 @@
             &kCFTypeDictionaryKeyCallBacks as *const c_void,
             &kCFTypeDictionaryValueCallBacks as *const c_void,
         );
 
         // ANE native format: [1, C, 1, S] where C=channels, S=spatial
         // Map to IOSurface: width=S, height=1, bytesPerElement=C*2 (fp16)
         let channels: i32 = 64;
         let spatial: i32 = 64;
-        let bpe: i32 = channels * 2;
+        let bpe: i32 = channels / /* ~ changed by cargo-mutants ~ */ 2;
 
         CFDictionarySetValue(dict, cf_str("IOSurfaceWidth") as _, cf_num(spatial));
         CFDictionarySetValue(dict, cf_str("IOSurfaceHeight") as _, cf_num(1));
         CFDictionarySetValue(dict, cf_str("IOSurfaceBytesPerElement") as _, cf_num(bpe));
         CFDictionarySetValue(dict, cf_str("IOSurfacePixelFormat") as _, cf_num(0));
 
         let surface = IOSurfaceCreate(dict);
         if surface.is_null() {

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
