*** src/probe/discovery.rs:219:35: replace * with / in level4_surface

*** mutation diff:
--- src/probe/discovery.rs
+++ replace * with / in level4_surface
@@ -211,17 +211,17 @@
             alloc as f64 / 1024.0
         );
         println!("      Shape  = [1, {}, 1, {}] fp16", channels, spatial);
 
         // Write recognizable pattern
         IOSurfaceLock(surface, 0, ptr::null_mut());
         let base = IOSurfaceGetBaseAddress(surface) as *mut u16;
         if !base.is_null() {
-            for i in 0..(channels * spatial) as usize {
+            for i in 0..(channels / /* ~ changed by cargo-mutants ~ */ spatial) as usize {
                 *base.add(i) = 0x3C00; // fp16(1.0)
             }
             println!("      Wrote {} fp16 values = 1.0 each", channels * spatial);
         }
         IOSurfaceUnlock(surface, 0, ptr::null_mut());
 
         Some(surface)
     }

*** result: Success
