*** src/probe/discovery.rs:232:5: replace level4_make_surface -> IOSurfaceRef with Default::default()

*** mutation diff:
--- src/probe/discovery.rs
+++ replace level4_make_surface -> IOSurfaceRef with Default::default()
@@ -224,32 +224,10 @@
         IOSurfaceUnlock(surface, 0, ptr::null_mut());
 
         Some(surface)
     }
 }
 
 /// Helper: create IOSurface of given byte size
 pub(crate) fn level4_make_surface(bytes: usize) -> IOSurfaceRef {
-    unsafe {
-        let dict = CFDictionaryCreateMutable(
-            ptr::null(),
-            0,
-            &kCFTypeDictionaryKeyCallBacks as *const c_void,
-            &kCFTypeDictionaryValueCallBacks as *const c_void,
-        );
-        CFDictionarySetValue(dict, cf_str("IOSurfaceWidth") as _, cf_num(bytes as i32));
-        CFDictionarySetValue(dict, cf_str("IOSurfaceHeight") as _, cf_num(1));
-        CFDictionarySetValue(dict, cf_str("IOSurfaceBytesPerElement") as _, cf_num(1));
-        CFDictionarySetValue(
-            dict,
-            cf_str("IOSurfaceBytesPerRow") as _,
-            cf_num(bytes as i32),
-        );
-        CFDictionarySetValue(
-            dict,
-            cf_str("IOSurfaceAllocSize") as _,
-            cf_num(bytes as i32),
-        );
-        CFDictionarySetValue(dict, cf_str("IOSurfacePixelFormat") as _, cf_num(0));
-        IOSurfaceCreate(dict)
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
