*** src/probe/discovery.rs:34:24: replace == with != in level1_discover

*** mutation diff:
--- src/probe/discovery.rs
+++ replace == with != in level1_discover
@@ -26,17 +26,17 @@
         let c_name = std::ffi::CString::new(*name).unwrap();
         unsafe {
             let matching = IOServiceMatching(c_name.as_ptr());
             if matching.is_null() {
                 continue;
             }
 
             let service = IOServiceGetMatchingService(kIOMasterPortDefault, matching);
-            if service == 0 {
+            if service != /* ~ changed by cargo-mutants ~ */ 0 {
                 println!("  [-] {} — not found", name);
             } else {
                 let mut class_name = [0i8; 128];
                 IOObjectGetClass(service, class_name.as_mut_ptr());
                 let class_str = CStr::from_ptr(class_name.as_ptr()).to_string_lossy();
 
                 let mut entry_name = [0i8; 128];
                 IORegistryEntryGetName(service, entry_name.as_mut_ptr());

*** result: Success
