*** src/probe/discovery.rs:56:32: replace == with != in level1_discover

*** mutation diff:
--- src/probe/discovery.rs
+++ replace == with != in level1_discover
@@ -48,17 +48,17 @@
                 );
 
                 // Read DeviceProperties
                 let key = cf_str("DeviceProperties");
                 let val = IORegistryEntryCreateCFProperty(service, key, ptr::null(), 0);
                 if !val.is_null() {
                     let type_id = CFGetTypeID(val);
                     let dict_id = CFDictionaryGetTypeID();
-                    if type_id == dict_id {
+                    if type_id != /* ~ changed by cargo-mutants ~ */ dict_id {
                         println!("      DeviceProperties = <CFDictionary>");
                     }
                     CFRelease(val);
                 }
 
                 if found_service.is_none() {
                     found_service = Some(service);
                 } else {

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:27:47:

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
