*** src/probe/discovery.rs:87:19: replace == with != in level2_open

*** mutation diff:
--- src/probe/discovery.rs
+++ replace == with != in level2_open
@@ -79,17 +79,17 @@
     println!("\n═══════════════════════════════════════════════════");
     println!("  LEVEL 2: Open User Client Connection");
     println!("═══════════════════════════════════════════════════\n");
 
     for uc_type in 0..=10 {
         unsafe {
             let mut connect: io_connect_t = 0;
             let kr = IOServiceOpen(service, mach_task_self(), uc_type, &mut connect);
-            if kr == KERN_SUCCESS {
+            if kr != /* ~ changed by cargo-mutants ~ */ KERN_SUCCESS {
                 println!(
                     "  [+] IOServiceOpen(type={}) => connection={:#x}  *** SUCCESS ***",
                     uc_type, connect
                 );
                 return Some(connect);
             } else {
                 println!("  [-] IOServiceOpen(type={}) => {}", uc_type, kern_err(kr));
             }

*** result: Success
