*** src/probe/ffi.rs:217:9: delete match arm KIO_NOT_PRIV in kern_err

*** mutation diff:
--- src/probe/ffi.rs
+++ delete match arm KIO_NOT_PRIV in kern_err
@@ -209,17 +209,17 @@
         )
     }
 }
 
 pub fn kern_err(kr: kern_return_t) -> String {
     match kr {
         0 => "KERN_SUCCESS".into(),
         KIO_BAD_ARG => "kIOReturnBadArgument".into(),
-        KIO_NOT_PRIV => "kIOReturnNotPrivileged".into(),
+         /* ~ changed by cargo-mutants ~ */
         KIO_UNSUPPORTED => "kIOReturnUnsupported".into(),
         KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
         KIO_NOT_READY => "kIOReturnNotReady".into(),
         KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
         _ => format!("{:#010x}", kr as u32),
     }
 }

*** result: Success
