*** src/probe/ffi.rs:221:9: delete match arm KIO_NOT_PERMITTED in kern_err

*** mutation diff:
--- src/probe/ffi.rs
+++ delete match arm KIO_NOT_PERMITTED in kern_err
@@ -213,17 +213,17 @@
 pub fn kern_err(kr: kern_return_t) -> String {
     match kr {
         0 => "KERN_SUCCESS".into(),
         KIO_BAD_ARG => "kIOReturnBadArgument".into(),
         KIO_NOT_PRIV => "kIOReturnNotPrivileged".into(),
         KIO_UNSUPPORTED => "kIOReturnUnsupported".into(),
         KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
         KIO_NOT_READY => "kIOReturnNotReady".into(),
-        KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
+         /* ~ changed by cargo-mutants ~ */
         _ => format!("{:#010x}", kr as u32),
     }
 }
 
 pub fn cf_desc(obj: *const c_void) -> String {
     if obj.is_null() {
         return "(null)".into();
     }

*** result: Success
