*** src/probe/ffi.rs:227:5: replace cf_desc -> String with String::new()

*** mutation diff:
--- src/probe/ffi.rs
+++ replace cf_desc -> String with String::new()
@@ -219,29 +219,17 @@
         KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
         KIO_NOT_READY => "kIOReturnNotReady".into(),
         KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
         _ => format!("{:#010x}", kr as u32),
     }
 }
 
 pub fn cf_desc(obj: *const c_void) -> String {
-    if obj.is_null() {
-        return "(null)".into();
-    }
-    unsafe {
-        let desc = CFCopyDescription(obj);
-        if desc.is_null() {
-            return "(no description)".into();
-        }
-        let mut buf = [0i8; 4096];
-        CFStringGetCString(desc, buf.as_mut_ptr(), 4096, kCFStringEncodingUTF8);
-        CFRelease(desc);
-        CStr::from_ptr(buf.as_ptr()).to_string_lossy().into_owned()
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn sel(name: &str) -> ObjcSel {
     let c = std::ffi::CString::new(name).unwrap();
     unsafe { sel_registerName(c.as_ptr()) }
 }
 
 pub fn cls(name: &str) -> ObjcClass {

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:21:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- multiple_runs_same_model stdout ----

thread 'multiple_runs_same_model' panicked at tests/hardware.rs:79:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
