*** src/probe/ffi.rs:227:5: replace cf_desc -> String with "xyzzy".into()

*** mutation diff:
--- src/probe/ffi.rs
+++ replace cf_desc -> String with "xyzzy".into()
@@ -219,29 +219,17 @@
         KIO_EXCLUSIVE => "kIOReturnExclusiveAccess".into(),
         KIO_NOT_READY => "kIOReturnNotReady".into(),
         KIO_NOT_PERMITTED => "kIOReturnNotPermitted".into(),
         _ => format!("{:#010x}", kr as u32),
     }
 }
 
 pub fn cf_desc(obj: *const c_void) -> String {
-    if obj.is_null() {
-        return "(null)".into();
-    }
-    unsafe {
-        let desc = CFCopyDescription(obj);
-        if desc.is_null() {
-            return "(no description)".into();
-        }
-        let mut buf = [0i8; 4096];
-        CFStringGetCString(desc, buf.as_mut_ptr(), 4096, kCFStringEncodingUTF8);
-        CFRelease(desc);
-        CStr::from_ptr(buf.as_ptr()).to_string_lossy().into_owned()
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn sel(name: &str) -> ObjcSel {
     let c = std::ffi::CString::new(name).unwrap();
     unsafe { sel_registerName(c.as_ptr()) }
 }
 
 pub fn cls(name: &str) -> ObjcClass {

*** result: Success
