*** src/probe/frameworks.rs:118:27: replace && with || in level5_frameworks

*** mutation diff:
--- src/probe/frameworks.rs
+++ replace && with || in level5_frameworks
@@ -110,17 +110,17 @@
 
     for sym in &key_symbols {
         let p = find_sym(sym);
         if !p.is_null() {
             println!("  [+] {:50} @ {:?}", sym, p);
         }
     }
 
-    if compiler.is_null() && services.is_null() && engine.is_null() {
+    if compiler.is_null() || /* ~ changed by cargo-mutants ~ */ services.is_null() && engine.is_null() {
         return None;
     }
 
     Some(AneFrameworks {
         compiler,
         services,
         engine,
     })

*** result: Success
