*** src/probe/frameworks.rs:152:8: delete ! in level6_direct_api

*** mutation diff:
--- src/probe/frameworks.rs
+++ delete ! in level6_direct_api
@@ -144,17 +144,17 @@
     println!("      → ANE hardware\n");
 
     println!("  IOKit selectors return kIOReturnNotPermitted because");
     println!("  our process lacks com.apple.ane.iokit-user-access entitlement.");
     println!("  Only aned has this. All user code goes through XPC.\n");
 
     // _ANEDaemonInterface — returns NSXPCInterface describing the protocol
     let daemon_iface = find_sym("_ANEDaemonInterface");
-    if !daemon_iface.is_null() {
+    if  /* ~ changed by cargo-mutants ~ */daemon_iface.is_null() {
         println!("  [+] _ANEDaemonInterface @ {:?}", daemon_iface);
         println!("      This returns the NSXPCInterface for talking to aned.");
         println!("      The ObjC classes wrap this, but we could call it directly.");
     }
 
     let daemon_iface_private = find_sym("_ANEDaemonInterfacePrivate");
     if !daemon_iface_private.is_null() {
         println!(

*** result: Success
