*** src/probe/frameworks.rs:43:5: replace load_framework -> *mut c_void with Default::default()

*** mutation diff:
--- src/probe/frameworks.rs
+++ replace load_framework -> *mut c_void with Default::default()
@@ -35,28 +35,17 @@
     pub engine: *mut c_void,
 }
 
 // ============================================================
 // Helpers
 // ============================================================
 
 fn load_framework(name: &str) -> *mut c_void {
-    let path = format!(
-        "/System/Library/PrivateFrameworks/{}.framework/{}",
-        name, name
-    );
-    let c = std::ffi::CString::new(path.as_str()).unwrap();
-    let h = unsafe { dlopen(c.as_ptr(), RTLD_NOW) };
-    if h.is_null() {
-        println!("  [-] {} — failed to load", name);
-    } else {
-        println!("  [+] {} — loaded @ {:?}", name, h);
-    }
-    h
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn find_sym(name: &str) -> *mut c_void {
     let c = std::ffi::CString::new(name).unwrap();
     let rtld_default = (-2isize) as *mut c_void;
     unsafe { dlsym(rtld_default, c.as_ptr()) }
 }

*** result: Success
