*** src/probe/frameworks.rs:59:25: delete - in find_sym

*** mutation diff:
--- src/probe/frameworks.rs
+++ delete - in find_sym
@@ -51,17 +51,17 @@
     } else {
         println!("  [+] {} — loaded @ {:?}", name, h);
     }
     h
 }
 
 pub(crate) fn find_sym(name: &str) -> *mut c_void {
     let c = std::ffi::CString::new(name).unwrap();
-    let rtld_default = (-2isize) as *mut c_void;
+    let rtld_default = ( /* ~ changed by cargo-mutants ~ */2isize) as *mut c_void;
     unsafe { dlsym(rtld_default, c.as_ptr()) }
 }
 
 // ============================================================
 // Level 5: Load ANE Frameworks (C API)
 // ============================================================
 
 pub(crate) fn level5_frameworks() -> Option<AneFrameworks> {

*** result: Success
