*** src/probe/frameworks.rs:68:5: replace level5_frameworks -> Option<AneFrameworks> with None

*** mutation diff:
--- src/probe/frameworks.rs
+++ replace level5_frameworks -> Option<AneFrameworks> with None
@@ -60,75 +60,17 @@
     unsafe { dlsym(rtld_default, c.as_ptr()) }
 }
 
 // ============================================================
 // Level 5: Load ANE Frameworks (C API)
 // ============================================================
 
 pub(crate) fn level5_frameworks() -> Option<AneFrameworks> {
-    println!("\n═══════════════════════════════════════════════════");
-    println!("  LEVEL 5: Load ANE Frameworks (C API)");
-    println!("═══════════════════════════════════════════════════\n");
-
-    let engine = load_framework("AppleNeuralEngine");
-    let compiler = load_framework("ANECompiler");
-    let services = load_framework("ANEServices");
-
-    // Now scan for key C functions across all loaded images
-    println!("\n  Key C functions (no ObjC needed):");
-    let key_symbols = [
-        // Compiler
-        "ANECCompile",
-        "ANECCompileJIT",
-        "ANECCompileOnline",
-        "ANECCompileOffline",
-        "ANECCreateCompilerInputDictionary",
-        "ANECCreateCompilerOptionDictionary",
-        "ANECCreateModelDictionary",
-        "ANECCreateDeviceProperty",
-        "ANECGetDeviceProperty",
-        "ANECValidate",
-        "ANECGetCompilerFileFormat",
-        // Services
-        "ANEServicesDeviceOpen",
-        "ANEServicesDeviceClose",
-        "ANEServicesProgramCreate",
-        "ANEServicesProgramPrepare",
-        "ANEServicesProgramInputsReady",
-        "ANEServicesProgramDestroy",
-        "ANEServicesProgramStop",
-        "ANEServicesProgramProcessRequestDirect",
-        "ANEServicesProgramOutputSetEnqueue",
-        "ANEServicesProgramMemoryMapRequest",
-        "ANEServicesProgramMemoryUnmapRequest",
-        "ANEServicesProgramChainingPrepare",
-        "ANEServicesInitializePlatformServices",
-        // Validation
-        "ANEValidateMILNetworkOnHost",
-        "ANEValidateNetworkCreate",
-        "ANEGetValidateNetworkSupportedVersion",
-    ];
-
-    for sym in &key_symbols {
-        let p = find_sym(sym);
-        if !p.is_null() {
-            println!("  [+] {:50} @ {:?}", sym, p);
-        }
-    }
-
-    if compiler.is_null() && services.is_null() && engine.is_null() {
-        return None;
-    }
-
-    Some(AneFrameworks {
-        compiler,
-        services,
-        engine,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // ============================================================
 // Level 6: Architecture Discovery + XPC detection
 // ============================================================
 
 pub(crate) fn level6_direct_api() {
     println!("\n═══════════════════════════════════════════════════");

*** result: Success
