*** src/surface.rs:104:9: replace Buffer::id -> u32 with 0

*** mutation diff:
--- src/surface.rs
+++ replace Buffer::id -> u32 with 0
@@ -96,17 +96,17 @@
 
     /// Get the raw IOSurfaceRef for passing to `Program::run_direct()`.
     pub fn as_raw(&self) -> IOSurfaceRef {
         self.raw
     }
 
     /// IOSurface ID.
     pub fn id(&self) -> u32 {
-        unsafe { IOSurfaceGetID(self.raw) }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Allocation size in bytes.
     pub fn size(&self) -> usize {
         self.size
     }
 }

---- surface_create_and_size stdout ----

thread 'surface_create_and_size' panicked at tests/integration.rs:13:5:
assertion failed: s.id() > 0

failures:
    surface_create_and_size

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
