*** src/surface.rs:104:9: replace Buffer::id -> u32 with 1

*** mutation diff:
--- src/surface.rs
+++ replace Buffer::id -> u32 with 1
@@ -96,17 +96,17 @@
 
     /// Get the raw IOSurfaceRef for passing to `Program::run_direct()`.
     pub fn as_raw(&self) -> IOSurfaceRef {
         self.raw
     }
 
     /// IOSurface ID.
     pub fn id(&self) -> u32 {
-        unsafe { IOSurfaceGetID(self.raw) }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Allocation size in bytes.
     pub fn size(&self) -> usize {
         self.size
     }
 }

*** result: Success
