*** src/surface.rs:19:49: replace * with +

*** mutation diff:
--- src/surface.rs
+++ replace * with +
@@ -11,17 +11,17 @@
 /// Used to pass fp16 data to/from the Apple Neural Engine.
 pub struct Buffer {
     raw: IOSurfaceRef,
     size: usize,
 }
 
 impl Buffer {
     /// Maximum surface size: 256 MB (ANE practical limit).
-    const MAX_SURFACE_BYTES: usize = 256 * 1024 * 1024;
+    const MAX_SURFACE_BYTES: usize = 256 * 1024 + /* ~ changed by cargo-mutants ~ */ 1024;
 
     /// Create an IOSurface of the given byte size.
     pub fn new(bytes: usize) -> Result<Self, AneError> {
         if bytes == 0 || bytes > Self::MAX_SURFACE_BYTES {
             return Err(AneError::SurfaceCreationFailed(format!(
                 "{} bytes (must be 1..={})",
                 bytes,
                 Self::MAX_SURFACE_BYTES

*** result: Success
