*** src/surface.rs:19:49: replace * with /

*** mutation diff:
--- src/surface.rs
+++ replace * with /
@@ -11,17 +11,17 @@
 /// Used to pass fp16 data to/from the Apple Neural Engine.
 pub struct Buffer {
     raw: IOSurfaceRef,
     size: usize,
 }
 
 impl Buffer {
     /// Maximum surface size: 256 MB (ANE practical limit).
-    const MAX_SURFACE_BYTES: usize = 256 * 1024 * 1024;
+    const MAX_SURFACE_BYTES: usize = 256 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024;
 
     /// Create an IOSurface of the given byte size.
     pub fn new(bytes: usize) -> Result<Self, AneError> {
         if bytes == 0 || bytes > Self::MAX_SURFACE_BYTES {
             return Err(AneError::SurfaceCreationFailed(format!(
                 "{} bytes (must be 1..={})",
                 bytes,
                 Self::MAX_SURFACE_BYTES

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:30:45:
called `Result::unwrap()` on an `Err` value: SurfaceCreationFailed("16384 bytes (must be 1..=256)")

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
