*** src/surface.rs:62:28: replace * with / in Buffer::with_shape

*** mutation diff:
--- src/surface.rs
+++ replace * with / in Buffer::with_shape
@@ -54,17 +54,17 @@
             }
             let size = IOSurfaceGetAllocSize(raw);
             Ok(Buffer { raw, size })
         }
     }
 
     /// Create with ANE tensor shape `[1, channels, 1, spatial]` in fp16.
     pub fn with_shape(channels: usize, spatial: usize) -> Result<Self, AneError> {
-        Self::new(channels * spatial * 2)
+        Self::new(channels / /* ~ changed by cargo-mutants ~ */ spatial * 2)
     }
 
     /// Lock surface, call closure with mutable fp16 slice, unlock.
     pub fn write<F, R>(&self, f: F) -> R
     where
         F: FnOnce(&mut [u16]) -> R,
     {
         unsafe {

---- surface_with_shape stdout ----

thread 'surface_with_shape' panicked at tests/integration.rs:18:41:
called `Result::unwrap()` on an `Err` value: SurfaceCreationFailed("0 bytes (must be 1..=268435456)")

failures:
    surface_with_shape

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
