*** src/surface.rs:73:33: replace / with % in Buffer::write

*** mutation diff:
--- src/surface.rs
+++ replace / with % in Buffer::write
@@ -65,17 +65,17 @@
     /// Lock surface, call closure with mutable fp16 slice, unlock.
     pub fn write<F, R>(&self, f: F) -> R
     where
         F: FnOnce(&mut [u16]) -> R,
     {
         unsafe {
             IOSurfaceLock(self.raw, 0, ptr::null_mut());
             let base = IOSurfaceGetBaseAddress(self.raw) as *mut u16;
-            let len = self.size / 2;
+            let len = self.size % /* ~ changed by cargo-mutants ~ */ 2;
             let slice = std::slice::from_raw_parts_mut(base, len);
             let result = f(slice);
             IOSurfaceUnlock(self.raw, 0, ptr::null_mut());
             result
         }
     }
 
     /// Lock surface (read-only), call closure with fp16 slice, unlock.

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:37:17:
index out of bounds: the len is 0 but the index is 0

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
