*** src/surface.rs:73:33: replace / with * in Buffer::write

*** mutation diff:
--- src/surface.rs
+++ replace / with * in Buffer::write
@@ -65,17 +65,17 @@
     /// Lock surface, call closure with mutable fp16 slice, unlock.
     pub fn write<F, R>(&self, f: F) -> R
     where
         F: FnOnce(&mut [u16]) -> R,
     {
         unsafe {
             IOSurfaceLock(self.raw, 0, ptr::null_mut());
             let base = IOSurfaceGetBaseAddress(self.raw) as *mut u16;
-            let len = self.size / 2;
+            let len = self.size * /* ~ changed by cargo-mutants ~ */ 2;
             let slice = std::slice::from_raw_parts_mut(base, len);
             let result = f(slice);
             IOSurfaceUnlock(self.raw, 0, ptr::null_mut());
             result
         }
     }
 
     /// Lock surface (read-only), call closure with fp16 slice, unlock.

*** result: Success
