*** src/surface.rs:89:33: replace / with % in Buffer::read

*** mutation diff:
--- src/surface.rs
+++ replace / with % in Buffer::read
@@ -81,17 +81,17 @@
     /// Lock surface (read-only), call closure with fp16 slice, unlock.
     pub fn read<F, R>(&self, f: F) -> R
     where
         F: FnOnce(&[u16]) -> R,
     {
         unsafe {
             IOSurfaceLock(self.raw, 1, ptr::null_mut()); // kIOSurfaceLockReadOnly = 1
             let base = IOSurfaceGetBaseAddress(self.raw) as *const u16;
-            let len = self.size / 2;
+            let len = self.size % /* ~ changed by cargo-mutants ~ */ 2;
             let slice = std::slice::from_raw_parts(base, len);
             let result = f(slice);
             IOSurfaceUnlock(self.raw, 1, ptr::null_mut());
             result
         }
     }
 
     /// Get the raw IOSurfaceRef for passing to `Program::run_direct()`.

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:50:35:
index out of bounds: the len is 0 but the index is 0

---- matmul_various_sizes stdout ----

thread 'matmul_various_sizes' panicked at tests/hardware.rs:94:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
