*** src/surface.rs:99:9: replace Buffer::as_raw -> IOSurfaceRef with Default::default()

*** mutation diff:
--- src/surface.rs
+++ replace Buffer::as_raw -> IOSurfaceRef with Default::default()
@@ -91,17 +91,17 @@
             let result = f(slice);
             IOSurfaceUnlock(self.raw, 1, ptr::null_mut());
             result
         }
     }
 
     /// Get the raw IOSurfaceRef for passing to `Program::run_direct()`.
     pub fn as_raw(&self) -> IOSurfaceRef {
-        self.raw
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// IOSurface ID.
     pub fn id(&self) -> u32 {
         unsafe { IOSurfaceGetID(self.raw) }
     }
 
     /// Allocation size in bytes.

---- compile_load_run_identity stdout ----

thread 'compile_load_run_identity' panicked at tests/hardware.rs:45:32:
called `Result::unwrap()` on an `Err` value: EvalFailed("Failed to wrap IOSurface")

---- compile_load_unload stdout ----

thread 'compile_load_unload' panicked at tests/hardware.rs:12:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- double_unload_is_safe stdout ----

thread 'double_unload_is_safe' panicked at tests/hardware.rs:59:30:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    compile_load_run_identity
    compile_load_unload
    double_unload_is_safe
    matmul_various_sizes
    multiple_runs_same_model
    run_direct_with_raw_surfaces
    run_direct_with_unimem_block
    run_without_load_fails

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
